R3b3lAllianc3/nRF52-ble-lr-demo/peripheral_lr_demo_kit/main - nrfx_swi.c
    nrf_gpio_cfg_output(PIN_EVENTS_END);
    nrf_gpio_cfg_output(PIN_EVENTS_CRC_OK);
    nrf_gpio_cfg_output(PIN_EVENTS_CRC_ERROR);
    nrf_gpio_cfg_output(PIN_EVENTS_READY);
        
    gpiote_out_init(GPIO_CH0, PIN_EVENTS_END, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // end
    gpiote_out_init(GPIO_CH1, PIN_EVENTS_CRC_OK, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // crc ok
    gpiote_out_init(GPIO_CH2, PIN_EVENTS_CRC_ERROR, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // crc error
    gpiote_out_init(GPIO_CH3, PIN_EVENTS_READY, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // events ready
        
    NRF_PPI->CH[PPI_CH0].EEP = (uint32_t) &(NRF_RADIO->EVENTS_END);
    NRF_PPI->CH[PPI_CH0].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH0]);

    NRF_PPI->CH[PPI_CH1].EEP = (uint32_t) &(NRF_RADIO->EVENTS_CRCOK);
    NRF_PPI->CH[PPI_CH1].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH1]);

    NRF_PPI->CH[PPI_CH2].EEP = (uint32_t) &(NRF_RADIO->EVENTS_CRCERROR);
    NRF_PPI->CH[PPI_CH2].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH2]);
               
    NRF_PPI->CH[PPI_CH3].EEP = (uint32_t) &(NRF_RADIO->EVENTS_READY);
    NRF_PPI->CH[PPI_CH3].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH3]);

    //MQ  Ensure EGU instance has been allocated.
    APP_ERROR_CHECK_BOOL(nrfx_swi_is_allocated(my_swi));

    //MQ  Fork tasks to activate EGU.    
    NRF_PPI->FORK[PPI_CH0].TEP = (uint32_t) &(nrfx_swi_egu_instance_get(my_swi)->TASKS_TRIGGER[EGU_CH0]);
    NRF_PPI->FORK[PPI_CH1].TEP = (uint32_t) &(nrfx_swi_egu_instance_get(my_swi)->TASKS_TRIGGER[EGU_CH1]);
    NRF_PPI->FORK[PPI_CH2].TEP = (uint32_t) &(nrfx_swi_egu_instance_get(my_swi)->TASKS_TRIGGER[EGU_CH2]);
    NRF_PPI->FORK[PPI_CH3].TEP = (uint32_t) &(nrfx_swi_egu_instance_get(my_swi)->TASKS_TRIGGER[EGU_CH3]);    
    
    NRF_PPI->CHENSET = (1 << PPI_CH0) | (1 << PPI_CH1) | (1 << PPI_CH2) | (1 << PPI_CH3);    
}

void swi_event_handler(nrf_swi_t swi, nrf_swi_flags_t flags)
{    
    //NRF_LOG_INFO("SWI ISR");
    /* If "my_swi" was triggered */
    if (swi == my_swi)
    {
        if (flags == (1 << EGU_CH0)) {
            ++end_event;                                   
            NRF_LOG_INFO("end");
        }
        if (flags == (1 << EGU_CH1)) {
            ++crc_ok_event;                                   
            NRF_LOG_INFO("ok");
        }
        if (flags == (1 << EGU_CH2)) {
            ++crc_error_event;                                   
            NRF_LOG_INFO("err");
        }
        if (flags == (1 << EGU_CH3)) {
            ++ready_event;                                   
            NRF_LOG_INFO("rdy");
        }
    }
    return;
}


static void init_swi(void)
{
    ret_code_t err_code;

    /* Initialize the library. */
    err_code = nrf_drv_swi_init();
    APP_ERROR_CHECK(err_code);

    /* Allocate and setup one SWI. */
    err_code = nrf_drv_swi_alloc(&my_swi, swi_event_handler, APP_IRQ_PRIORITY_LOW);
    APP_ERROR_CHECK(err_code);
}


int main(void)
{
    // Initialize.
    log_init();
   
    timer_init();
    buttons_leds_init();
    init_swi();
    init_ppi();

    power_management_init();
    ble_stack_init();
    gap_params_init();


    // Start execution.
   
    NRF_LOG_INFO("Long range demo  --peripheral--");
    instructions_print();

    set_current_adv_params_and_start_advertising();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
